/*************************************************************************
*  Copyright (C) 2004 by Janek Kozicki                                   *
*  cosurgi@berlios.de                                                    *
*                                                                        *
*  This program is free software; it is licensed under the terms of the  *
*  GNU General Public License v2 or later. See file LICENSE for details. *
*************************************************************************/

#pragma once


#include "Indexable.hpp"


#include<sudodem/lib/factory/ClassFactory.hpp>
#include<sudodem/lib/serialization/Serializable.hpp>

#include<sudodem/lib/multimethods/loki/Functor.h>
#include<sudodem/lib/multimethods/loki/Typelist.h>
#include<sudodem/lib/multimethods/loki/TypeManip.h>
#include<sudodem/lib/multimethods/loki/NullType.h>
// compat with former sudodem's local Loki
#define TYPELIST_1 LOKI_TYPELIST_1
#define TYPELIST_2 LOKI_TYPELIST_2
#define TYPELIST_3 LOKI_TYPELIST_3
#define TYPELIST_4 LOKI_TYPELIST_4
#define TYPELIST_5 LOKI_TYPELIST_5
#define TYPELIST_6 LOKI_TYPELIST_6
#define TYPELIST_7 LOKI_TYPELIST_7
#define TYPELIST_8 LOKI_TYPELIST_8
#define TYPELIST_9 LOKI_TYPELIST_9

#include<vector>
#include<list>
#include<string>
#include<ostream>

struct DynLibDispatcher_Item2D{ int ix1, ix2; std::string functorName; DynLibDispatcher_Item2D(int a, int b, std::string c):ix1(a),ix2(b),functorName(c){}; };
struct DynLibDispatcher_Item1D{ int ix1     ; std::string functorName; DynLibDispatcher_Item1D(int a,        std::string c):ix1(a),       functorName(c){}; };
///
/// base classes involved in multiple dispatch must be derived from Indexable
///

/// base template for all dispatchers								///

template
<
	class BaseClass,	//	a typelist with base classess involved in the dispatch (or single class, for 1D )
				// 		FIXME: should use shared_ptr references, like this: DynLibDispatcher< TYPELIST_2( shared_ptr<PhysicalAction>& , shared_ptr<Body>& ) , ....
	class Executor,		//	class which gives multivirtual function
	class ResultType,	//	type returned by multivirtual function
	class TList,		//	typelist of arguments passed to multivirtual function
				//	WARNING: first arguments must be shared_ptr<BaseClass>, for details see FunctorWrapper

	bool autoSymmetry=true	//	true -	the function called is always the same,
				//		only order of arguments is rearranged
				//		to make correct function call,
				//		only go() is called
				//
				//	false -	the function called is always different.
				//		arguments order is not rearranged
				//		go(), and goReverse() are called, respectively
				//
>
class DynLibDispatcher
{
		// this template recursively defines a type for callBacks matrix, with required number of dimensions
	private:
		template<class T > struct Matrix
		  {
			typedef Loki::NullType ResultIterator;
			typedef Loki::NullType ResultIteratorInt;
		  };

	template<class Head > struct Matrix< Loki::Typelist< Head, Loki::NullType > >
		  {
			typedef vector< shared_ptr< Executor > > 			Result;
			typedef vector< int > 						ResultInt;
			typedef typename vector< shared_ptr< Executor > >::iterator 	ResultIterator;
			typedef vector< int >::iterator 				ResultIteratorInt;
		  };

	template<class Head, class Tail >
		  struct Matrix< Loki::Typelist< Head, Tail > >
		  {
			// recursive typedef to get matrix of required dimensions
			typedef typename Matrix< Tail >::Result 		InsideType;
			typedef typename Matrix< Tail >::ResultInt 		InsideTypeInt;
			typedef vector< InsideType > 				Result;
			typedef vector< InsideTypeInt > 			ResultInt;
			typedef typename vector< InsideType >::iterator 	ResultIterator;
			typedef typename vector< InsideTypeInt >::iterator 	ResultIteratorInt;
		  };

		// this template helps declaring iterators for each dimension of callBacks matrix
	template<class T > struct GetTail
		  {
			typedef Loki::NullType Result;
		  };

	template<class Head, class Tail>
		  struct GetTail< Loki::Typelist< Head , Tail > >
		  {
			typedef Tail Result;
		  };

	template<class Head >
		  struct GetTail< Loki::Typelist< Head , Loki::NullType > >
		  {
			typedef Loki::NullType Result;
		  };

	template <typename G, typename T, typename U>
		  struct Select
		  {
			typedef T Result;
		  };

	template <typename T, typename U>
		  struct Select<Loki::NullType, T, U>
		  {
			typedef U Result;
		  };

	typedef typename Loki::TL::Append<  Loki::NullType , BaseClass >::Result BaseClassList;
	typedef typename Loki::TL::TypeAtNonStrict<BaseClassList , 0>::Result	BaseClass1;  // 1D
	typedef typename Loki::TL::TypeAtNonStrict<BaseClassList , 1>::Result	BaseClass2;  // 2D
	typedef typename Loki::TL::TypeAtNonStrict<BaseClassList , 2>::Result	BaseClass3;  // 3D

	typedef typename GetTail< BaseClassList >::Result			Tail2; // 2D
	typedef typename GetTail< Tail2 >::Result				Tail3; // 3D
	typedef typename GetTail< Tail3 >::Result				Tail4; // 4D ...

	typedef typename Matrix< BaseClassList >::ResultIterator 		Iterator2; // outer iterator 2D
	typedef typename Matrix< Tail2 >::ResultIterator			Iterator3; // inner iterator 3D
	typedef typename Matrix< Tail3 >::ResultIterator			Iterator4; // more inner iterator 4D

	typedef typename Matrix< BaseClassList >::ResultIteratorInt		IteratorInfo2;
	typedef typename Matrix< Tail2 >::ResultIteratorInt			IteratorInfo3;
	typedef typename Matrix< Tail3 >::ResultIteratorInt			IteratorInfo4;

	typedef typename Matrix< BaseClassList >::Result MatrixType;
	typedef typename Matrix< BaseClassList >::ResultInt MatrixIntType;
	MatrixType callBacks;		// multidimensional matrix that stores functors ( 1D, 2D, 3D, 4D, ....)
	MatrixIntType callBacksInfo;	// multidimensional matrix for extra information about functors in the matrix
						// currently used to remember if it is reversed functor

	// ParmNReal is defined to avoid ambigious function call for different dimensions of multimethod
	typedef Loki::FunctorImpl<ResultType, TList > Impl;
	typedef TList ParmList;
	typedef Loki::NullType Parm1; 						// it's always at least 1D
	typedef typename Impl::Parm2 Parm2Real;
	typedef typename Select< Tail2 , Loki::NullType , Parm2Real >::Result Parm2; 	// 2D
	typedef typename Impl::Parm3 Parm3Real;
	typedef typename Select< Tail3 , Loki::NullType , Parm3Real >::Result Parm3; 	// 3D - to have 3D just working, without symmetry handling - change this line to be: typedef typename Impl::Parm3 Parm3;
	typedef typename Impl::Parm4 Parm4Real;
	typedef typename Select< Tail4 , Loki::NullType , Parm4Real >::Result Parm4;	// 4D - same as above
	typedef typename Impl::Parm5 Parm5;
	typedef typename Impl::Parm6 Parm6;
	typedef typename Impl::Parm7 Parm7;
	typedef typename Impl::Parm8 Parm8;
	typedef typename Impl::Parm9 Parm9;
	typedef typename Impl::Parm10 Parm10;
	typedef typename Impl::Parm11 Parm11;
	typedef typename Impl::Parm12 Parm12;
	typedef typename Impl::Parm13 Parm13;
	typedef typename Impl::Parm14 Parm14;
	typedef typename Impl::Parm15 Parm15;

 	public:
		DynLibDispatcher()
		  {
			// FIXME - static_assert( typeid(BaseClass1) == typeid(Parm1) ); // 1D
			// FIXME - static_assert( typeid(BaseClass2) == typeid(Parm2) ); // 2D
			clearMatrix();
		};

		void clearMatrix(){ callBacks.clear(); callBacksInfo.clear(); }

		shared_ptr<Executor> getExecutor(shared_ptr<BaseClass1>& arg1){
		  	int ix1;
